public_html/Algorithms/Algorithms FAQ.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Algorithms FAQ</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Algorithms FAQ"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-29T00:48+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Algorithms FAQ</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">洗牌程序</a>
<ul>
<li><a href="#sec-1-1">递归二分随机抽牌</a></li>
<li><a href="#sec-1-2">快排Hack法</a></li>
<li><a href="#sec-1-3">大多数人的实现</a></li>
<li><a href="#sec-1-4">正确的算法</a></li>
<li><a href="#sec-1-5">模拟我们玩牌洗牌的算法</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">洗牌程序</h2>
<div class="outline-text-2" id="text-1">

<p><a href="http://coolshell.cn/articles/8593.html">http://coolshell.cn/articles/8593.html</a>
</p>
</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">递归二分随机抽牌</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="src src-c"><span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#36882;&#24402;&#20108;&#20998;&#26041;&#27861;</span>
<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">MAXLEN</span> = 10;
<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">TestArr</span>[MAXLEN] = {<span style="color: #ffa07a;">'A'</span>,<span style="color: #ffa07a;">'B'</span>,<span style="color: #ffa07a;">'C'</span>,<span style="color: #ffa07a;">'D'</span>,<span style="color: #ffa07a;">'E'</span>,<span style="color: #ffa07a;">'F'</span>,<span style="color: #ffa07a;">'G'</span>,<span style="color: #ffa07a;">'H'</span>,<span style="color: #ffa07a;">'I'</span>,<span style="color: #ffa07a;">'J'</span>};

<span style="color: #00ffff;">static</span> <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">RecurArr</span>[MAXLEN]={0};
<span style="color: #00ffff;">static</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">cnt</span> = 0;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">ShuffleArray_Recursive_Tmp</span>(<span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">arr</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">len</span>)
{
    <span style="color: #00ffff;">if</span>(cnt &gt; MAXLEN || len &lt;=0){
        <span style="color: #00ffff;">return</span>;
    }

    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">pos</span> = rand() % len;
    RecurArr[cnt++] = arr[pos];
    <span style="color: #00ffff;">if</span> (len==1) <span style="color: #00ffff;">return</span>;
    ShuffleArray_Recursive_Tmp(arr, pos);
    ShuffleArray_Recursive_Tmp(arr+pos+1, len-pos-1);
}

<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">ShuffleArray_Recursive</span>(<span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">arr</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">len</span>)
{
    memset(RecurArr, 0, <span style="color: #00ffff;">sizeof</span>(RecurArr));
    cnt=0;
    ShuffleArray_Recursive_Tmp(arr, len);
    memcpy(arr, RecurArr, len);
}

<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>()
{
    <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">temp</span>[MAXLEN]={0};
    <span style="color: #00ffff;">for</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span>=0; i&lt;5; i++) {
        strncpy(temp, TestArr, MAXLEN);
        ShuffleArray_Recursive((<span style="color: #98fb98;">char</span>*)temp, MAXLEN);
    }
}
</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">快排Hack法</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="src src-c"><span style="color: #98fb98;">int</span> <span style="color: #87cefa;">compare</span>( <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span> *<span style="color: #eedd82;">a</span>, <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span> *<span style="color: #eedd82;">b</span> )
{
    <span style="color: #00ffff;">return</span> rand()%3-1;
}

<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">ShuffleArray_Sort</span>(<span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">arr</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">len</span>)
{
    qsort( (<span style="color: #98fb98;">void</span> *)arr, (<span style="color: #98fb98;">size_t</span>)len, <span style="color: #00ffff;">sizeof</span>(<span style="color: #98fb98;">char</span>), compare );
}
</pre>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">大多数人的实现</h3>
<div class="outline-text-3" id="text-1-3">




<pre class="src src-c"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">ShuffleArray_General</span>(<span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">arr</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">len</span>)
{
    <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">suff_time</span> = len;
    <span style="color: #00ffff;">for</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">idx</span>=0; idx&lt;suff_time; idx++) {
        <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span> = rand() % len;
        <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">j</span> = rand() % len;
        <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">temp</span> = arr[i];
        arr[i] = arr[j];
        arr[j] = temp;
    }
}
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">正确的算法</h3>
<div class="outline-text-3" id="text-1-4">

<p><a href="http://en.wikipedia.org/wiki/Fisher–Yates_shuffle">Fisher<sub>Yates算法</sub></a>
</p>


<pre class="src src-c"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">ShuffleArray_Fisher_Yates</span>(<span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">arr</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">len</span>)
{
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span> = len, <span style="color: #eedd82;">j</span>;
    <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">temp</span>;

    <span style="color: #00ffff;">if</span> ( i == 0 ) <span style="color: #00ffff;">return</span>;
    <span style="color: #00ffff;">while</span> ( --i ) {
        j = rand() % (i+1);
        temp = arr[i];
        arr[i] = arr[j];
        arr[j] = temp;
    }
}
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">模拟我们玩牌洗牌的算法</h3>
<div class="outline-text-3" id="text-1-5">




<pre class="src src-c"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">ShuffleArray_Manual</span>(<span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">arr</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">len</span>)
{
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">mid</span> = len / 2;

    <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>=0; n&lt;5; n++){

        <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#20004;&#25163;&#27927;&#29260;</span>
        <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span>=1; i&lt;mid; i+=2){
            <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">tmp</span> = arr[i];
            arr[i] = arr[mid+i];
            arr[mid+i] = tmp;
        }

        <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#38543;&#26426;&#20999;&#29260;</span>
        <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">buf</span> = (<span style="color: #98fb98;">char</span>*)malloc(<span style="color: #00ffff;">sizeof</span>(<span style="color: #98fb98;">char</span>)*len);

        <span style="color: #00ffff;">for</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">j</span>=0; j&lt;5; j++) {
            <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">start</span>= rand() % (len-1) + 1;
            <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">numCards</span>= rand()% (len/2) + 1;

            <span style="color: #00ffff;">if</span> (start + numCards &gt; len ){
                numCards = len - start;
            }

            memset(buf, 0, len);
            strncpy(buf, arr, start);
            strncpy(arr, arr+start, numCards);
            strncpy(arr+numCards, buf, start);
        }
        free(buf);

    }
}
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-29T00:48+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2+ with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
